package main

var (
	STARTUP_MESSAGE   = "Привет!!!\nЭто приветственное сообщение."
	COMMANDS          = "привет - поприветствую\n'нуклеотиды' - узнать подробнее про нуклеотиды"
	LAYER1BUTTON1TEXT = "Адени́н — азотистое основание, аминопроизводное пурина (6-аминопурин). Образует две водородных связи с урацилом и тимином (комплементарность). "
	LAYER1BUTTON2TEXT = "Гуани́н (Гуа, Gua) — органическое соединение, азотистое основание, аминопроизводное пурина (2-амино-6-оксопурин), является составной частью нуклеиновых кислот. В ДНК при репликации и транскрипции образует три водородных связи с цитозином (Cyt) (комплементарность)."
	LAYER1BUTTON3TEXT = "Тимин (5-метилурацил) — производное пиримидина, одно из пяти азотистых оснований. Присутствует во всех живых организмах, где вместе с дезоксирибозой входит в состав нуклеозида тимидина, который может фосфорилироваться 1—3 остатками фосфорной кислоты с образованием нуклеотидов тимидина и моно-, ди- или трифосфорной кислоты (ТМФ, ТДФ и ТТФ). Дезоксирибонуклеотиды тимина входят в состав ДНК, в РНК на его месте располагается рибонуклеотид урацил. В ДНК тимин (Т) комплементарен аденину (А), образуя с ним две водородные связи, тем самым стабилизируя связи между цепями нуклеиновых кислот. "
	LAYER1BUTTON4TEXT = "Цитозин — органическое соединение, азотистое основание, производное пиримидина. С рибозой образует нуклеозид цитидин, входит в состав нуклеотидов ДНК и РНК. Во время репликации и транскрипции по принципу комплементарности образует три водородных связи с гуанином. "
	ADENIN_WIKI       = "https://ru.wikipedia.org/wiki/%D0%90%D0%B4%D0%B5%D0%BD%D0%B8%D0%BD"
	TIMIN_WIKI        = "https://ru.wikipedia.org/wiki/%D0%A2%D0%B8%D0%BC%D0%B8%D0%BD"
	CITOZIN_WIKI      = "https://ru.wikipedia.org/wiki/%D0%A6%D0%B8%D1%82%D0%BE%D0%B7%D0%B8%D0%BD"
	GUANIN_WIKI       = "https://ru.wikipedia.org/wiki/%D0%93%D1%83%D0%B0%D0%BD%D0%B8%D0%BD"
)
